app/nvmf_iaa/fio_engine/results_lat/2k_latency.out
=== run_latency_pair.sh ===
timestamp: 2026-03-26 15:34:43
bs: 2k
size: 2k
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: ./snic_phase1.so

=== WRITE ===
job0: (g=0): rw=write, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7fc264112040 size=1568
[Init] DECOMP AECS loaded: addr=0x7fc264119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7fc264112040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7fc264119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=20809: Thu Mar 26 15:34:43 2026
  write: IOPS=500, BW=1000KiB/s (1024kB/s)(2048B/2msec)
    clat (nsec): min=1084.1k, max=1084.1k, avg=1084119.00, stdev= 0.00
     lat (nsec): min=1085.2k, max=1085.2k, avg=1085187.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1090],  5.00th=[ 1090], 10.00th=[ 1090], 20.00th=[ 1090],
     | 30.00th=[ 1090], 40.00th=[ 1090], 50.00th=[ 1090], 60.00th=[ 1090],
     | 70.00th=[ 1090], 80.00th=[ 1090], 90.00th=[ 1090], 95.00th=[ 1090],
     | 99.00th=[ 1090], 99.50th=[ 1090], 99.90th=[ 1090], 99.95th=[ 1090],
     | 99.99th=[ 1090]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1000KiB/s (1024kB/s), 1000KiB/s-1000KiB/s (1024kB/s-1024kB/s), io=2048B (2048B), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%

=== READ ===
job0: (g=0): rw=read, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
job0: Laying out IO file (1 file / 0MiB)
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x7e73d8112040 size=1568
[Init] DECOMP AECS loaded: addr=0x7e73d8119140 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 32 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x7e73d8112040 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x7e73d8119140 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job0: (groupid=0, jobs=1): err= 0: pid=20870: Thu Mar 26 15:34:44 2026
  read: IOPS=500, BW=1000KiB/s (1024kB/s)(2048B/2msec)
    clat (nsec): min=1083.1k, max=1083.1k, avg=1083055.00, stdev= 0.00
     lat (nsec): min=1083.8k, max=1083.8k, avg=1083783.00, stdev= 0.00
    clat percentiles (usec):
     |  1.00th=[ 1090],  5.00th=[ 1090], 10.00th=[ 1090], 20.00th=[ 1090],
     | 30.00th=[ 1090], 40.00th=[ 1090], 50.00th=[ 1090], 60.00th=[ 1090],
     | 70.00th=[ 1090], 80.00th=[ 1090], 90.00th=[ 1090], 95.00th=[ 1090],
     | 99.00th=[ 1090], 99.50th=[ 1090], 99.90th=[ 1090], 99.95th=[ 1090],
     | 99.99th=[ 1090]
  lat (msec)   : 2=100.00%
  cpu          : usr=0.00%, sys=0.00%, ctx=1, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1000KiB/s (1024kB/s), 1000KiB/s-1000KiB/s (1024kB/s-1024kB/s), io=2048B (2048B), run=2-2msec

Disk stats (read/write):
  nvme1n1: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%