app/nvmf_iaa/fio_engine/results_lat/32k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-07 22:42:48
rw: write
cq_size: 32
total_ios: 32
bs: 32k
size: 1048576
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio_engine/iaanic.so
poll_usleep: 0
job: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x74f674119240 size=1568
[Init] DECOMP AECS loaded: addr=0x74f674131a80 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 64 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x74f674119240 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x74f674131a80 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job: (groupid=0, jobs=1): err= 0: pid=21789: Tue Apr  7 22:42:48 2026
  write: IOPS=10.7k, BW=333MiB/s (350MB/s)(1024KiB/3msec)
    clat (usec): min=62, max=117, avg=68.64, stdev=10.32
     lat (usec): min=63, max=118, avg=69.23, stdev=10.44
    clat percentiles (usec):
     |  1.00th=[   63],  5.00th=[   63], 10.00th=[   64], 20.00th=[   64],
     | 30.00th=[   65], 40.00th=[   66], 50.00th=[   66], 60.00th=[   68],
     | 70.00th=[   68], 80.00th=[   69], 90.00th=[   75], 95.00th=[   87],
     | 99.00th=[  118], 99.50th=[  118], 99.90th=[  118], 99.95th=[  118],
     | 99.99th=[  118]
  lat (usec)   : 100=96.88%, 250=3.12%
  cpu          : usr=50.00%, sys=0.00%, ctx=0, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=333MiB/s (350MB/s), 333MiB/s-333MiB/s (350MB/s-350MB/s), io=1024KiB (1049kB), run=3-3msec